# WireConduitTypeSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireConduitTypeSet Constructor
WireConduitTypeSet Class See Also
---
Initializes a new instance of the WireConduitTypeSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireConduitTypeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
WireConduitTypeSet()
```

# See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace